divaldo95/STMSensorThread/Receiver/STM32_WPAN/App/app_thread.c
  /* Init config buffer and call TL_THREAD_Init */
  APP_THREAD_TL_THREAD_INIT();

  /* Configure UART for sending CLI command from M4 */
  APP_THREAD_Init_UART_CLI();

  /* Send Thread start system cmd to M0 */
  ThreadInitStatus = SHCI_C2_THREAD_Init();

  /* Prevent unused argument(s) compilation warning */
  UNUSED(ThreadInitStatus);

  /* Register task */
  /* Create the different tasks */
  UTIL_SEQ_RegTask( 1<<(uint32_t)CFG_TASK_MSG_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_THREAD_ProcessMsgM0ToM4);

  /* USER CODE BEGIN INIT TASKS */

  /* USER CODE END INIT TASKS */

  /* Initialize and configure the Thread device*/
  APP_THREAD_DeviceConfig();

  /* USER CODE BEGIN APP_THREAD_INIT_2 */

  /* USER CODE END APP_THREAD_INIT_2 */
}

/**
  * @brief  Trace the error or the warning reported.
  * @param  ErrId :
  * @param  ErrCode
  * @retval None
  */
void APP_THREAD_Error(uint32_t ErrId, uint32_t ErrCode)
{
  /* USER CODE BEGIN APP_THREAD_Error_1 */

  /* USER CODE END APP_THREAD_Error_1 */
  switch(ErrId)
  {
  case ERR_REC_MULTI_MSG_FROM_M0 :
    APP_THREAD_TraceError("ERROR : ERR_REC_MULTI_MSG_FROM_M0 ", ErrCode);
    break;
  case ERR_THREAD_SET_STATE_CB :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_STATE_CB ",ErrCode);
    break;
  case ERR_THREAD_ERASE_PERSISTENT_INFO :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_ERASE_PERSISTENT_INFO ",ErrCode);
    break;
  case ERR_THREAD_SET_NETWORK_KEY :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_NETWORK_KEY ",ErrCode);
    break;
  case ERR_THREAD_CHECK_WIRELESS :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_CHECK_WIRELESS ",ErrCode);
    break;
  /* USER CODE BEGIN APP_THREAD_Error_2 */

  /* USER CODE END APP_THREAD_Error_2 */
  default :
    APP_THREAD_TraceError("ERROR Unknown ", 0);
    break;
  }
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief Thread initialization.
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void)
{
  otError error;
  error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error((uint32_t)ERR_THREAD_SET_STATE_CB, (uint32_t)ERR_INTERFACE_FATAL);
  }

  /* USER CODE BEGIN DEVICECONFIG */

     error = otInstanceErasePersistentInfo(NULL);
     if (error != OT_ERROR_NONE)
     {
       APP_THREAD_Error(ERR_THREAD_ERASE_PERSISTENT_INFO,error);
     }
     otInstanceFinalize(NULL);
     otInstanceInitSingle();
     error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
     if (error != OT_ERROR_NONE)
     {
       APP_THREAD_Error(ERR_THREAD_SET_STATE_CB,error);
     }
     error = otLinkSetChannel(NULL, C_CHANNEL_NB);
     if (error != OT_ERROR_NONE)
     {
      // APP_THREAD_Error(ERR_THREAD_SET_CHANNEL,error);
     }
     error = otLinkSetPanId(NULL, C_PANID);
     if (error != OT_ERROR_NONE)
     {
       //APP_THREAD_Error(ERR_THREAD_SET_PANID,error);
     }
     error = otThreadSetNetworkKey(NULL, &networkKey);
     if (error != OT_ERROR_NONE)
     {
       APP_THREAD_Error(ERR_THREAD_SET_NETWORK_KEY,error);
     }

     otNetifAddress aAddress;
     error = otIp6AddressFromString("DEAD:BEAF:0000:0000:0000:0000:0000:0000", &aAddress);
     if (error != OT_ERROR_NONE)
     {
     		printf("otIp6AddressFromString error\r\n");
     		while(1);
     }

     error = otIp6AddUnicastAddress (NULL,  &aAddress);
	 if (error != OT_ERROR_NONE)
     {
		      printf("otIp6AddUnicastAddress error\r\n");
		      while(1);
	 }


	 error = otThreadSetMeshLocalPrefix(NULL, &mesh_local_prefix);
	 if (error != OT_ERROR_NONE)
	 {
			      printf("otThreadSetMeshLocalPrefix error\r\n");
			      while(1);
	 }



     error = otIp6SetEnabled(NULL, true);
     if (error != OT_ERROR_NONE)
     {
       //APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE,error);
     }
     error = otThreadSetEnabled(NULL, true);
     if (error != OT_ERROR_NONE)
     {
      // APP_THREAD_Error(ERR_THREAD_START,error);
     }


     memset(&mSocket, 0, sizeof(mSocket));

     /* Open socket */
     otUdpOpen(NULL, &mSocket, HandleUdpReceive, NULL);
     UdpBind(udpPort);

  /* USER CODE END DEVICECONFIG */
}

/**
 * @brief Thread notification when the state changes.
 * @param  aFlags  : Define the item that has been modified
 *         aContext: Context
 *
 * @retval None
 */


static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pContext);

  /* USER CODE BEGIN APP_THREAD_STATENOTIF */

  /* USER CODE END APP_THREAD_STATENOTIF */

  if ((NotifFlags & (uint32_t)OT_CHANGED_THREAD_ROLE) == (uint32_t)OT_CHANGED_THREAD_ROLE)
  {
    switch (otThreadGetDeviceRole(NULL))
    {
    case OT_DEVICE_ROLE_DISABLED:
      /* USER CODE BEGIN OT_DEVICE_ROLE_DISABLED */
    	HAL_GPIO_WritePin(LED_BLUE_GPIO_Port, LED_BLUE_Pin, 0);
    	HAL_GPIO_WritePin(LED_GREEN_GPIO_Port, LED_GREEN_Pin, 0);
    	HAL_GPIO_WritePin(RED_LED_GPIO_Port, RED_LED_Pin, 0);
      /* USER CODE END OT_DEVICE_ROLE_DISABLED */
      break;
    case OT_DEVICE_ROLE_DETACHED:
      /* USER CODE BEGIN OT_DEVICE_ROLE_DETACHED */
    	HAL_GPIO_WritePin(LED_BLUE_GPIO_Port, LED_BLUE_Pin, 0);
    	HAL_GPIO_WritePin(LED_GREEN_GPIO_Port, LED_GREEN_Pin, 0);
    	HAL_GPIO_WritePin(RED_LED_GPIO_Port, RED_LED_Pin, 1);
      /* USER CODE END OT_DEVICE_ROLE_DETACHED */
      break;
    case OT_DEVICE_ROLE_CHILD:
      /* USER CODE BEGIN OT_DEVICE_ROLE_CHILD */
    	HAL_GPIO_WritePin(LED_BLUE_GPIO_Port, LED_BLUE_Pin, 0);
        HAL_GPIO_WritePin(LED_GREEN_GPIO_Port, LED_GREEN_Pin, 1);
    	HAL_GPIO_WritePin(RED_LED_GPIO_Port, RED_LED_Pin, 0);
      /* USER CODE END OT_DEVICE_ROLE_CHILD */
      break;
    case OT_DEVICE_ROLE_ROUTER :
      /* USER CODE BEGIN OT_DEVICE_ROLE_ROUTER */
    	HAL_GPIO_WritePin(LED_BLUE_GPIO_Port, LED_BLUE_Pin, 1);
    	HAL_GPIO_WritePin(LED_GREEN_GPIO_Port, LED_GREEN_Pin, 0);
    	HAL_GPIO_WritePin(RED_LED_GPIO_Port, RED_LED_Pin, 0);
      /* USER CODE END OT_DEVICE_ROLE_ROUTER */
      break;
    case OT_DEVICE_ROLE_LEADER :
      /* USER CODE BEGIN OT_DEVICE_ROLE_LEADER */
    	HAL_GPIO_WritePin(LED_BLUE_GPIO_Port, LED_BLUE_Pin, 1);
        HAL_GPIO_WritePin(LED_GREEN_GPIO_Port, LED_GREEN_Pin, 1);
    	HAL_GPIO_WritePin(RED_LED_GPIO_Port, RED_LED_Pin, 0);
      /* USER CODE END OT_DEVICE_ROLE_LEADER */
      break;
    default:
      /* USER CODE BEGIN DEFAULT */

